tutorials/multiphase/interFoam/laminar/vofToLagrangian/eulerianInjection/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication  -s createBlockage topoSet -dict system/topoSetDict.createBlockage
runApplication subsetMesh -overwrite blockage -patch bottom
runApplication -s createPatch topoSet -dict system/topoSetDict.createPatch
runApplication -s createCollector topoSet -dict system/topoSetDict.createCollector

restore0Dir

runApplication decomposePar

runParallel setFields
runParallel $(getApplication)

#------------------------------------------------------------------------------
